{
    "albums": [{
        "albumname" : "Gish",
        "shortname": "gish",
        "releasedate": 1991,
        "summary" : "Gish is the debut studio album by American alternative rock band the Smashing Pumpkins, released in May 1991 through Caroline Records. Frontman Billy Corgan has variously described Gish as a \"very spiritual album\" and \"an album about spiritual ascension\". Despite initially peaking at only number 195 on the Billboard 200 upon its release, Gish received positive reviews from critics, and was eventually certified platinum (one million copies shipped in the US) by the RIAA. On April 1, 2019 Rolling Stone magazine ranked Gish the 32nd greatest grunge album of all time.",
        "artwork": ["images/gish.jpg"],
        "tracklist": ["I Am One", "Siva", "Rhinoceros", "Bury Me", "Crush", "Suffer", "Snail", "Tristessa", "Window Paine", "Daydream"],
        "albumAM": "https://music.apple.com/us/album/gish-deluxe-edition/1471016488",
        "albumSM": "https://open.spotify.com/album/14gI3ml0wxlgVrX1ve8zyJ?si=tXu0Go0oRrugs0JqQHe_Gg"
    },
    {
        "albumname" : "Siamese Dream",
        "shortname": "siamese_dream",
        "releasedate": 1993,
        "summary" : "Siamese Dream is the second studio album by American alternative rock band the Smashing Pumpkins, released on July 27, 1993 on Virgin Records. The album has received widespread acclaim by audiences and critics alike, with the album's musical influences and lyrical material standing out compared to other alternative records released during its time. The album has since been considered one of the finest alt-rock albums of all time. Despite recording sessions fraught with difficulties and tensions, Siamese Dream debuted at number ten on the Billboard charts, and eventually was certified 4x Platinum, with the album selling over six million copies worldwide, cementing the Smashing Pumpkins as an important group in alternative rock music. Four singles were released in support of Siamese Dream: 'Cherub Rock', 'Today', 'Disarm', and 'Rocket'. In addition to receiving widespread critical acclaim upon its release, Siamese Dream has widely been regarded as one of the greatest albums of the 1990s, and one of the greatest albums of all time. Rolling Stone magazine has ranked it between numbers 341 - 362 on various versions of their 500 Greatest Albums of All Time list.",
        "artwork": ["images/siamese_dream_reissue.jpeg"],
        "tracklist": ["Cherub Rock", "Quiet", "Today", "Hummer", "Rocket", "Disarm", "Soma", "Geek U.S.A", "Mayonaise", "Spaceboy", "Silverfuck", "Sweet Sweet", "Luna"],
        "albumAM": "https://music.apple.com/us/album/siamese-dream/721207206",
        "albumSM": "https://open.spotify.com/album/0bQglEvsHphrS19FGODEGo?si=b7S3IEf2QI24-zfjKHcgqA"
    },
    {
        "albumname" : "Mellon Collie and the Infinite Sadness",
        "shortname": "mellon_collie",
        "releasedate": 1995,
        "summary" : "Mellon Collie and the Infinite Sadness is the third studio album by American alternative rock band the Smashing Pumpkins, released on October 24, 1995, in the United Kingdom and a day later in the United States on Virgin Records. Produced by frontman Billy Corgan with Flood and Alan Moulder, the 28-track album was released as a two-disc CD and triple LP. The album features a wide array of styles, as well as greater musical input from bassist D'arcy Wretzky and second guitarist James Iha.Propelled by the album's lead single, 'Bullet with Butterfly Wings', it debuted at number one on the US Billboard 200 with first week sales of 246,500 units. To date it remains the band's only album to top the Billboard 200. It spawned five more singles— '1979', 'Zero', 'Tonight, Tonight', the promotional 'Muzzle', and 'Thirty-Three'—over the course of 1996, and was certified diamond by the RIAA, equivalent to more than 10 million units sold. Praised by critics for its ambition and scope, Mellon Collie and the Infinite Sadness earned the band seven Grammy Award nominations in 1997, including Album of the Year and Record of the Year ('1979'), as well as nine MTV Music Video Awards nominations, eight of which were for 'Tonight, Tonight', including \"Video of the Year\". Not only did they all become hits on both mainstream rock and modern rock stations, but 'Bullet with Butterfly Wings', '1979', 'Tonight, Tonight', and 'Thirty-Three' also became the band's first Top 40 hits, crossing over to pop radio stations.",
        "artwork": ["images/mellon_collie_and_the_infinite_sadness.jpg"],
        "tracklist": ["Mellon Collie and the Infinite Sadness", 	"Tonight, Tonight", "Jellybelly", 	"Zero", "Here Is No Why", 	"Bullet with Butterfly Wings", "To Forgive", "Fuck You (An Ode to No One)", "Love", "Cupid de Locke", 	"Galapogos", "Muzzle",	"Porcelina of the Vast Oceans", "Take Me Down", "Where Boys Fear to Tread", "Bodies", "Thirty-Three", "In the Arms of Sleep", "1979", "Tales of a Scorched Earth", "Thru the Eyes of Ruby", "Stumbleine", "X.Y.U.", "We Only Come Out at Night", "Beautiful", "Lily (My One and Only", "By Starlight", "Farewell and Goodnight"],
        "albumAM": "https://music.apple.com/us/album/mellon-collie-and-the-infinite-sadness-remastered/721224313",
        "albumSM": "https://open.spotify.com/album/55RhFRyQFihIyGf61MgcfV?si=caaLr-cNRH-t8L3lGhDz-Q"
    },
    {
        "albumname" : "Adore",
        "shortname": "adore",
        "releasedate": 1998,
        "summary" : "Adore is the fourth studio album by the American alternative rock band the Smashing Pumpkins, released on June 2, 1998, by Virgin Records. After the multi-platinum success of Mellon Collie and the Infinite Sadness and a subsequent yearlong world tour, follow-up Adore was considered 'one of the most anticipated albums of 1998' by MTV. Recording the album proved to be a challenge as the band members struggled with lingering interpersonal problems and musical uncertainty in the wake of three increasingly successful rock albums and the departure of drummer Jimmy Chamberlin. Frontman Billy Corgan would later characterize Adore as made by 'a band falling apart'. Corgan was also going through a divorce and the death of his mother while recording the album. The result was a much more subdued and electronica-tinged sound that Greg Kot of Rolling Stone magazine called 'a complete break with the past'. The album divided the fan base and sold only a fraction of the previous two albums. However, the album was well received by critics, becoming the third straight Pumpkins album to be nominated for the Grammy Award for Best Alternative Music Performance, and has gained a cult following. A remastered and expanded version of the album was released on CD and vinyl in September 2014 as a part of the band's project to reissue their back catalogue from 1991 to 2000. This is their only album to be recorded as trio, and their first album not to feature an official drummer.",
        "artwork": ["images/adore.jpg"],
        "tracklist": ["To Sheila", "Ava Adore", "Perfect", "Daphne Descends", "Once Upon a Time", "Tear", "Crestfallen", "Appels + Oranjes", "Pug", "The Tale of Dusty and Pistol Pete", "Annie-Dog", "Shame", "Behold! The Night Mare", "For Martha", "Blank Page", "17"],
        "albumAM": "https://music.apple.com/us/album/adore-super-deluxe-edition/1434727046",
        "albumSM": "https://open.spotify.com/album/7ysKTnHt4ve0MvIWm3vPdz?si=gS1cAziiRyuO-30prLSzmg"
    },
    {
        "albumname" : "Machina/The Machines of God",
        "shortname": "machinaI",
        "releasedate": 2000,
        "summary" : "<b><i>Machina/The Machines of God</i></b> is the fifth studio album by the American alternative rock band The Smashing Pumpkins, released on February 29, 2000, by Virgin Records. A concept album, it marked the return of drummer Jimmy Chamberlin and was intended to be the band's final official LP release prior to their first break up in 2000. A sequel album—Machina II/The Friends & Enemies of Modern Music—was later released independently via the Internet, and limited quantities for the physical version.<br><br>As with its predecessor, <b><i>Adore</i></b>, Machina represented a drastic image and sound change for the band that failed to reconnect them with chart-topping success. However, after the relatively brief Adore tour, the new line-up with Chamberlin and the former Hole bass guitarist Melissa Auf der Maur mounted longer international tours that returned the live incarnation of the band to a guitar-driven hard rock style.",
        "artwork": ["images/machina.jpg"],
        "tracklist": ["The Everlasting Gaze", "Raindrops + Sunshowers", "Stand Inside Your Love", "I of the Mourning", "The Sacred and Profane", "Try, Try, Try", "Heavy Metal Machine", "This Time", "The Imploding Voice", "Glass and the Ghost Children", "Wound", "The Crying Tree of Mercury", "With Every Light", "Blue Skies Bring Tears", "Age of Innocence"],
        "albumAM": "https://music.apple.com/us/album/machina-the-machines-of-god/712756036",
        "albumSM": "https://open.spotify.com/album/4hrZp6mKgz0HG7UpRbNYQx?si=1Zx6wmQeSeiX-gYNjGKrGg"
    },
    {
        "albumname" : "Machina II/The Friends & Enemies of Modern Music",
        "shortname": "machinaII",
        "releasedate": 2000,
        "summary" : "<b><i>Machina II/The Friends & Enemies of Modern Music</i></b> is the sixth studio album by the American alternative rock band The Smashing Pumpkins. It was released for free on the Internet on September 5, 2000. Plans for a standard physical release, bundled with the first part Machina/The Machines of God, were revealed to happen sometime in 2013, but was postponed due to legal setbacks. In an Instagram Q&A in 2018, the band's frontman, Billy Corgan, revealed that all legal issues had been resolved. The two albums are planned to be remastered and released as a deluxe reissue; however, no release date has been announced.<br><br>The album itself, a double LP, was packaged with three EPs full of B-sides and alternate versions. The album's artwork was created by Carlos Segura. Both Machina albums are loose concept albums telling the story of 'a rock star gone mad'. Machina II was the last Smashing Pumpkins studio album until the band reformed in 2006, and also their final studio album to feature guitarist James Iha until his return on 2018's <b><i>Shiny and Oh So Bright, Vol. 1 / LP: No Past. No Future. No Sun.</i></b>",
        "artwork": ["images/machinaii.jpg"],
        "tracklist": ["Glass", "Cash Car Star", "Dross", "Real Love", "Go", "Let Me Give the World to You", "Innosense", "Home", "Blue Skies Bring Tears", "White Spyder", "In My Body", "If There Is a God", "Le Deux Machnia", "Atom Bomb", "Slow Dawn", "Vanity", "Saturnine", "Sould Power", "Lucky 13", "Speed Kills", "Try", "Heavy Metal Machine"],
        "albumAM": "",
        "albumSM": ""
    },
    {
        "albumname" : "Zeitgeist",
        "shortname": "zeitgeist",
        "releasedate": 2007,
        "summary" : "<b><i>Zeitgeist</i></b> is the seventh studio album by American rock band the Smashing Pumpkins, released on July 10, 2007 on Martha's Music and Reprise Records. Recorded solely by returning band members Billy Corgan and Jimmy Chamberlin, the album was the band's first since reuniting in 2006, and was produced by Roy Thomas Baker and Terry Date, alongside Corgan and Chamberlin themselves.<br><br>Preceded by the single, <i>Tarantula</i>, the album debuted at number two on the US Billboard 200, but sales soon decreased, and critical reception was mixed. It was certified Gold in the United States on February 1, 2008. To tour in support of the release, Corgan and Chamberlin recruited touring members, Jeff Schroeder (guitar), Ginger Reyes (bass) and Lisa Harriton (keyboards), with Schroeder eventually becoming a core member of the band. The album was the last to feature Chamberlin until 2018's <b><i>Shiny and Oh So Bright, Vol. 1 / LP: No Past. No Future. No Sun.</i></b>",
        "artwork": ["images/zeitgeist.png"],
        "tracklist": ["Doomsday Clock", "7 Shades of Black", "Bleeding the Orchid", "That's the Way (My Love Is)", "Tarantula", "Starz", "United States", "Neverlost", "Bring the Light", "(Come On) Let's Go!", "For God and Country", "Pomp and Circumstances", "Zeitgeist"],
        "albumAM": "",
        "albumSM": ""
    },
    {
        "albumname" : "Oceania",
        "shortname": "oceania",
        "releasedate": 2012,
        "summary" : "<b><i>Oceania</i></b> is the eighth studio album by American alternative rock band the Smashing Pumpkins, released on June 19, 2012 through Martha's Music. The album was produced by Billy Corgan and Bjorn Thorsrud, and forms part of the band's 34-track music project Teargarden by Kaleidyscope. It was their first studio album to feature guitarist Jeff Schroeder, and their only album to contain contributions from bassist Nicole Fiorentino and drummer Mike Byrne, who replaced original drummer Jimmy Chamberlin.<br><br>The album was a critical and commercial success, debuting at number four on the Billboard 200. As of September 2012, Oceania sold over 102,000 copies in the US. A live performance of the album, Oceania: Live in NYC, was released on September 24, 2013.",
        "artwork": ["images/oceania.jpg"],
        "tracklist": ["Quasar", "Panopticon", "The Celestials", "Violet Rays", "My Love is Winter", "One Diamond, One Heart", "Pinwheels", "Oceania", "Pale Horse", "The Chimera", "Glissandra", "Inkless", "Wildflower"],
        "albumAM": "https://music.apple.com/us/album/oceania/720200110",
        "albumSM": "https://open.spotify.com/album/4JSNpsxNnuVDKMyNd2CrZt?si=9Q6lLZPqTG633ZBwvTBYGw"
    },
    {
        "albumname" : "Monuments to an Elegy",
        "shortname": "monuments",
        "releasedate": 2014,
        "summary" : "<b><i>Monuments to an Elegy</i></b> is the ninth studio album by American alternative rock band The Smashing Pumpkins, released on December 9, 2014 on Martha's Music. Band leader Billy Corgan noted that—similar to the band's previous release, Oceania—the album is part of the 34-track music project, Teargarden by Kaleidyscope. It is considered the last part in the series due to cancellation of the project in 2018 by Corgan. This is their second album after 1998's <b></i>Adore</i></b> to not feature the official drummer, their second album after 2007's <b><i>Zeitgeist</i></b> to not feature the official bassist (Corgan taking over the contribution for the album, and continuing for their subsequent albums), and their second album also after <b><i>Zeitgeist</i></b> to be recorded as a duo (Corgan and guitarist Jeff Schroeder), with drumming contributions from Mötley Crüe's Tommy Lee, and being the last album before the return of original guitarist and drummer, James Iha and Jimmy Chamberlin, respectively in 2018.<br><br>The album received generally positive reviews from music critics, but sold poorly compared to the band's previous albums, peaking at number 33 in the U.S. and number 59 in the U.K., thus making it (at the time) their lowest charting album in both regions since their debut, <br><i>Gish</i></b> (1991).",
        "artwork": ["images/monuments_to_an_elegy.jpg"],
        "tracklist": ["Tiberius", "Being Beige", "Anaise!", "One and All (We Are)", "Run2Me", "Drum + Fife", "Monuments", "Dorian", "Anti-Hero"],
        "albumAM": "https://music.apple.com/us/album/monuments-to-an-elegy/1401014336",
        "albumSM": "https://open.spotify.com/album/06Z1pfDp7Ujg6MkK7dKbnh?si=IEb8vLluThOKFkHFlSWrcg"
    },
    {
        "albumname" : "Shiny and Oh So Bright, Vol.1/LP: No Past. No Future. No Sun",
        "shortname": "shiny",
        "releasedate": 2018,
        "summary" : "<b><i>Shiny and Oh So Bright Vol. 1 / LP: No Past. No Future. No Sun.</i></b> is the tenth studio album by the American alternative rock band The Smashing Pumpkins, released on November 16, 2018 through Napalm Records. Produced by Rick Rubin, it is the band's first album to feature founding members James Iha and Jimmy Chamberlin since <b><i>Machina II/The Friends and Enemies of Modern Music</i></b> (2000) and <b><i>Zeitgeist</i></b> (2007), respectively.<br><br>Initially planned as two four-song EPs, the release was preceded by the singles, <i>Solara</i>, <i>Silvery Sometimes (Ghosts)</i> and <i>Knights of Malta</i>, and reached number fifty-four on the US Billboard 200 chart.",
        "artwork": ["images/shiny_and_oh_so_bright.jpeg"],
        "tracklist": ["Knights of Malta", "Silvery Sometimes (Ghosts)", "Travels", "Solara", "Alienation", "Marchin' On", "With Sympathy", "Seek and You Shall Destroy"],
        "albumAM": "https://music.apple.com/us/album/shiny-and-oh-so-bright-vol-1-no-past-no-future-no-sun/1435622689",
        "albumSM": "https://open.spotify.com/album/43Ov5N3lHVLZj8sUpFvihN?si=Kuo2ilUPQ9Gv4SukeQ5Q5A"
    },
    {
        "albumname" : "Cyr",
        "shortname": "cyr",
        "releasedate": 2020,
        "summary" : "<b><i>Cyr</i></b> is the eleventh studio album by American alternative rock band the Smashing Pumpkins, released on November 27, 2020, on Sumerian Records. Produced by band leader Billy Corgan, the album features a synth-pop sound and was preceded by the release of ten of its songs as singles, with Corgan actively seeking out a 'contemporary' sound during the recording process.<br><br>The release of Cyr was accompanied by a five-part animated series, <i>In Ashes</i>, written by Corgan and directed by Mike Anderson, which served as official videos for five of the album's tracks.",
        "artwork": ["images/cyr.jpg"],
        "tracklist": ["The Color of Love", "Confessions of a Dopamine Addict", "Cyr", "Dulcet in E", "Wrath", "Ramona", "Anno Satana", "Birch Grove", "Wyttch", "Starrcraft", "Purple Blood", "Save Your Tears", "Telegenix", "Black Forest, Black Hills", "Adrennalynne", "Haunted", "The Hidden Sun", "Schaudenfreud", "Tyger, Tyger", "Minerva"],
        "albumAM": "https://music.apple.com/us/album/cyr-video-version/1541844522",
        "albumSM": "https://open.spotify.com/album/6jyVmM4JOjBSzJqSa4fRaI?si=dV4OnJWhRMaJzUrU2UPX7Q"
    }
]}